import React, { FC } from 'react';
import './Privecy.scss';

const Privecy: FC = () => (
  <section className="privecy">
    <h1 className="privecy__title">Политика конфедициальности </h1>
    <p className="privecy__text">
      Настоящий документ «Пользовательское соглашение» представляет собой
      предложение АВТОМЕН (далее — «Администрация»), заключить договор на
      изложенных ниже условиях Соглашения.{' '}
    </p>
    <h2 className="privecy__subtitle">
      1. Общие положения Пользовательского соглашения{' '}
    </h2>
    <p className="privecy__text">
      1.1. В настоящем документе и вытекающих или связанным с ним отношениях
      Сторон применяются следующие термины и определения: а) Платформа —
      программно-аппаратные средства, интегрированные с Сайтом Администрации;
      Пользователь — дееспособное физическое лицо, присоединившееся к настоящему
      Соглашению в собственном интересе либо выступающее от имени и в интересах
      представляемого им юридического лица. в) Сайт Администрации/ Сайт —
      интернет-сайты, размещенные в домене avto-tinder.gq и его поддоменах.
      Сервис — комплекс услуг и лицензия, предоставляемые Пользователю с
      использованием Платформы. д) Соглашение — настоящее соглашение со всеми
      дополнениями и изменениями. 1.2. Использование вами Сервиса любым способом
      и в любой форме в пределах его объявленных функциональных возможностей,
      включая: просмотр размещенных на Сайте материалов; регистрация и/или
      авторизация на Сайте; размещение или отображение на Сайте любых
      материалов, включая, но не ограничиваясь такими как: тексты,
      гипертекстовые ссылки, изображения, аудио и видео- файлы, сведения и/или
      иная информация; создает договор на условиях настоящего Соглашения в
      соответствии с положениями ст.437 и 438 Гражданского кодекса Российской
      Федерации. 1.3. Воспользовавшись любой из указанных выше возможностей по
      использованию Сервиса вы подтверждаете, что: а) Ознакомились с условиями
      настоящего Соглашения в полном объеме до начала использования Сервиса. б)
      б) Принимаете все условия настоящего Соглашения в полном объеме без
      каких-либо изъятий и ограничений с вашей стороны и обязуетесь их соблюдать
      или прекратить использование Сервиса. Если вы не согласны с условиями
      настоящего Соглашения или не имеете права на заключение договора на их
      основе, вам следует незамедлительно прекратить любое использование
      Сервиса. в) Соглашение (в том числе любая из его частей) может быть
      изменено Администрацией без какого-либо специального уведомления. Новая
      редакция Соглашения вступает в силу с момента ее размещения на Сайте
      Администрации либо доведения до сведения Пользователя в иной удобной
      форме, если иное не предусмотрено новой редакцией Соглашения.
    </p>
    <h2 className="privecy__subtitle">2. Общие условия пользования Сервисом</h2>
    <p className="privecy__text">
      2.1. Использование функциональных возможностей Сервиса допускается только
      после прохождения Пользователем регистрации и авторизации на Сайте в
      соответствии с установленной Администрацией процедурой. 2.2. Технические,
      организационные и коммерческие условия использования Сервиса, в том числе
      его функциональных возможностей доводятся до сведения Пользователей путем
      отдельного размещения на Сайте или путем нотификации Пользователей. 2.3.
      Выбранные Пользователем логин и пароль являются необходимой и достаточной
      информацией для доступа Пользователя на Сайт. Пользователь не имеет права
      передавать свои логин и пароль третьим лицам, несет полную ответственность
      за их сохранность, самостоятельно выбирая способ их хранения.
    </p>
  </section>
);

export { Privecy };
